; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	thermograph3 - mode
	thermograph2 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star2 - direction
	Star1 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Planet7 image1)
	(have_image Star8 image1)
	(have_image Planet9 image1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 thermograph2)
	(have_image Star12 thermograph3)
	(have_image Star13 image1)
	(have_image Star14 spectrograph0)
	(have_image Phenomenon15 thermograph2)
	(have_image Planet16 thermograph2)
	(have_image Planet17 thermograph3)
	(have_image Phenomenon18 image1)
))

)

; plan
1. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 planet16 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet16)
   goals met: 0 of 12
5. (take_image satellite0 planet16 instrument0 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 1 of 12
6. (turn_to satellite0 planet11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet11)
   goals met: 1 of 12
7. (take_image satellite0 planet11 instrument0 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon18 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon18 instrument0 image1)
   added: (have_image phenomenon18 image1)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon15 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon15 instrument0 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon10 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 5 of 12
14. (turn_to satellite0 planet17 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet17)
   goals met: 5 of 12
15. (take_image satellite0 planet17 instrument0 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 6 of 12
16. (turn_to satellite0 planet7 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet7)
   goals met: 6 of 12
17. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 7 of 12
18. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 7 of 12
19. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 8 of 12
20. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 8 of 12
21. (take_image satellite0 star12 instrument0 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 9 of 12
22. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 9 of 12
23. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 10 of 12
24. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 10 of 12
25. (take_image satellite0 star14 instrument0 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 11 of 12
26. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 11 of 12
27. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 12 of 12
